In [1]:
import pandas as pd

In [2]:
#Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
data = [4,8,15,16,23,42]
df = pd.Series(data)

In [4]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(df)

pandas.core.series.Series

In [6]:
variable = [15,'ssjs',2.5,'adib',525,52,98,954,45]
df = pd.Series(variable)

In [7]:
df

0      15
1    ssjs
2     2.5
3    adib
4     525
5      52
6      98
7     954
8      45
dtype: object

In [8]:
# 3 question 


data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']}
df = pd.DataFrame(data)

In [9]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [10]:
#4 question

In [11]:
A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
A Pandas Series is like a column in a table.

SyntaxError: invalid syntax (3529283106.py, line 1)

In [12]:
# 5 question 
Series = Mutable

Dataframe  = Mutable
Panel = Mutable

NameError: name 'Mutable' is not defined

In [15]:
# 6 question 
import pandas as pd 
name = pd.Series(['shubham','pranjal','sanket'])
weight = pd.Series([67,55,60])
height = pd.Series([5.11,5.6,6.1])
data = {'name':name,
        'weight':weight,
        'height':height}
df = pd.DataFrame(data)

In [16]:
df

      name  weight  height
0  shubham      67    5.11
1  pranjal      55    5.60
2   sanket      60    6.10

In [ ]:
#7 question 
there are multiple function we can use in pandas to manipulate the data 
ex = pd.Dataframe() we can use this funtion to create a dataframe
df['clnname'] = by using this funciton we can create a new column in data frame 
df.columns it will give the name of the columns in the data frame 
df